mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
#include "sha256.h"

// The application watchdog survives the NVIC reset used to enter this
// bootloader. Normal BLE/USB DFU reloads it from bootloader.c's event loop,
// while the in-place delta applier runs outside that loop. Keep every enabled
// reload channel alive throughout the potentially long scan/hash/apply path.
// A host test has no hardware watchdog, so this becomes a no-op there.
static void inherited_watchdog_feed(void) {
#ifndef OTA_DELTA_HOST_TEST
  static uint8_t external_feed_divider;

  if (NRF_WDT->RUNSTATUS != 0) {
    const uint32_t enabled_channels = NRF_WDT->RREN & 0xFFu;
    for (uint8_t channel = 0; channel < 8; channel++) {
      if ((enabled_channels & (1u << channel)) != 0) {
        NRF_WDT->RR[channel] = WDT_RR_RR_Reload;
      }
    }
  }

  // The external watchdog pulse is deliberately less frequent than the cheap
  // internal reload. Hashing calls this checkpoint every 256 bytes; pulsing on
  // every call would add several seconds to a large update.
  if ((external_feed_divider++ & 0x7FU) == 0) {
    board_watchdog_feed();
  }
#endif
}

static uint32_t rd_u32(const uint8_t *p) {
  return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

#if defined(MOTA_SD_CARD)
static uint32_t g_sd_first_sector;
static uint32_t g_sd_total_size;

// In an SD build, patch/container offsets are relative to the first sector
// named by the handoff. Internal-flash builds continue to use absolute flash
// addresses, preserving the existing tested path.
static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  if ((uint64_t)address_or_offset + len > g_sd_total_size) {
    return 0;
  }
  return ota_sd_read_bytes(g_sd_first_sector, address_or_offset, dst, len) ? 1 : 0;
}
#elif defined(MOTA_QSPI_FLASH)
static uint32_t g_qspi_total_size;
static int      g_qspi_source;

static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  if (g_qspi_source) {
    if ((uint64_t)address_or_offset + len > g_qspi_total_size) {
      return 0;
    }
    return ota_qspi_read(address_or_offset, dst, len) ? 1 : 0;
  }
  fl_read(address_or_offset, dst, len);
  return 1;
}
#else
static int staged_read(uint32_t address_or_offset, void *dst, uint32_t len) {
  fl_read(address_or_offset, dst, len);
  return 1;
}
#endif

// Tiny bounds-checked cursor so the manifest is parsed by reading each field by name in order, instead of
// hand-computed offsets (mirrors MeshCore's OtaByteIO.h ByteReader). Any over-read flips ok=0.
typedef struct {
  const uint8_t *p;
  uint32_t       len, n;
  int            ok;
} br_t;
static uint8_t br_u8(br_t *r) {
  if (r->ok && (uint64_t)r->n + 1 <= r->len) {
    return r->p[r->n++];
  }
  r->ok = 0;
  return 0;
}
static uint32_t br_u32(br_t *r) {
  if (r->ok && (uint64_t)r->n + 4 <= r->len) {
    uint32_t v = rd_u32(r->p + r->n);
    r->n += 4;
    return v;
  }
  r->ok = 0;
  return 0;
}
static const uint8_t *br_take(br_t *r, uint32_t k) {
  if (r->ok && (uint64_t)r->n + k <= r->len) {
    const uint8_t *x = r->p + r->n;
    r->n += k;
    return x;
  }
  r->ok = 0;
  return NULL;
}
static void br_skip(br_t *r, uint32_t k) {
  if (r->ok && (uint64_t)r->n + k <= r->len) {
    r->n += k;
  } else {
    r->ok = 0;
  }
}

static void sha256_region(uint32_t addr, uint32_t len, uint8_t out[32]) {
  sha256_ctx_t c;
  sha256_init(&c);
  uint8_t buf[256];
  while (len) {
    inherited_watchdog_feed();
    uint32_t n = len < sizeof(buf) ? len : sizeof(buf);
    fl_read(addr, buf, n);
    sha256_update(&c, buf, n);
    addr += n;
    len -= n;
  }
  sha256_final(&c, out);
}

// ---- coherent single-page write-back cache (in-place reads back shifted data it just wrote) -------
static uint8_t  g_cache[PAGE] __attribute__((aligned(4)));
static uint32_t g_cache_page; // page-aligned addr; 0 == INVALID (no app page is at 0)
static int      g_cache_dirty;

static void cache_flush(void) {
  if (!g_cache_page) {
    return;
  }
  if (g_cache_dirty) {
    inherited_watchdog_feed();
    fl_erase(g_cache_page);
    inherited_watchdog_feed();
    fl_write_words(g_cache_page, (const uint32_t *)g_cache, PAGE / 4);
  }
  g_cache_page  = 0;
  g_cache_dirty = 0;
}
static void cache_use(uint32_t page) {
  if (g_cache_page == page) {
    return;
  }
  cache_flush();
  g_cache_page  = page;
  g_cache_dirty = 0;
  fl_read(page, g_cache, PAGE);
}
static void cread(uint32_t addr, uint8_t *dst, uint32_t n) { // coherent read (overlay dirty page)
  fl_read(addr, dst, n);
  if (g_cache_page && g_cache_dirty) {
    uint32_t cs = g_cache_page, ce = g_cache_page + PAGE, a = addr, e = addr + n;
    uint32_t os = a > cs ? a : cs, oe = e < ce ? e : ce;
    if (os < oe) {
      memcpy(dst + (os - a), g_cache + (os - cs), oe - os);
    }
  }
}
static void cwrite(uint32_t addr, const uint8_t *src, uint32_t n) {
  while (n) {
    uint32_t page = addr & ~(PAGE - 1), off = addr - page, chunk = PAGE - off;
    if (chunk > n) {
      chunk = n;
    }
    cache_use(page);
    memcpy(g_cache + off, src, chunk);
    g_cache_dirty = 1;
    addr += chunk;
    src += chunk;
    n -= chunk;
  }
}
static void cerase(uint32_t addr, uint32_t n) { // detools calls this page-aligned
  while (n) {
    uint32_t page = addr & ~(PAGE - 1), off = addr - page, step = PAGE - off;
    if (step > n) {
      step = n;
    }
    if (g_cache_page == page) {
      memset(g_cache, 0xFF, PAGE);
      g_cache_dirty = 1;
    } else {
      fl_erase(page);
    }
    addr += step;
    n -= step;
  }
}

// ---- detools in-place callbacks (region addresses are 0-based; base sits at workspace offset 0) ---
struct apply_ctx {
  uint32_t patch_addr, patch_len, patch_pos;
  uint32_t ws_lo, ws_hi; // workspace = [ws_lo, ws_hi); ws_hi == mota start (never written)
  int      step;
};
static int dt_ws_addr(const struct apply_ctx *c, uintptr_t off, size_t n, uint32_t *addr) {
  uint32_t span = c->ws_hi - c->ws_lo;
  if (off > UINT32_MAX || n > UINT32_MAX) {
    return 0;
  }
  uint32_t o = (uint32_t)off, z = (uint32_t)n;
  if (o > span || z > span - o) {
    return 0;
  }
  *addr = c->ws_lo + o;
  return 1;
}
static int dt_mr(void *a, void *dst, uintptr_t src, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, src, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cread(addr, dst, n);
  return DETOOLS_OK;
}
static int dt_mw(void *a, uintptr_t dst, void *src, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, dst, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cwrite(addr, (const uint8_t *)src, n);
  return DETOOLS_OK;
}
static int dt_me(void *a, uintptr_t addr0, size_t n) {
  struct apply_ctx *c = a;
  uint32_t          addr;
  if (!dt_ws_addr(c, addr0, n, &addr)) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  cerase(addr, n);
  return DETOOLS_OK;
}
static int dt_ss(void *a, int s) {
  ((struct apply_ctx *)a)->step = s;
  return DETOOLS_OK;
}
static int dt_sg(void *a, int *s) {
  *s = ((struct apply_ctx *)a)->step;
  return DETOOLS_OK;
}
static int dt_pr(void *a, uint8_t *dst, size_t n) {
  struct apply_ctx *c = a;
  if (n > UINT32_MAX || c->patch_pos > c->patch_len || (uint32_t)n > c->patch_len - c->patch_pos) {
    return -DETOOLS_IO_FAILED;
  }
  inherited_watchdog_feed();
  if (!staged_read(c->patch_addr + c->patch_pos, dst, (uint32_t)n)) {
    return -DETOOLS_IO_FAILED;
  }
  c->patch_pos += (uint32_t)n;
  return DETOOLS_OK;
}

// Decode the five unsigned sizes in an in-place detools header without starting the decoder. This lets
// us reject impossible flash geometry while the running application and its boot settings are intact.
static int dt_header_u32(uint32_t addr, uint32_t len, uint32_t *pos, uint32_t *out) {
  uint8_t b;
  if (*pos >= len) {
    return 0;
  }
  if (!staged_read(addr + (*pos)++, &b, 1)) {
    return 0;
  }
  uint32_t v     = b & 0x3Fu;
  uint32_t shift = 6;
  while (b & 0x80u) {
    if (*pos >= len) {
      return 0;
    }
    if (!staged_read(addr + (*pos)++, &b, 1)) {
      return 0;
    }
    uint32_t bits = b & 0x7Fu;
    if (shift >= 32 || bits > (UINT32_MAX >> shift)) {
      return 0;
    }
    v |= bits << shift;
    shift += 7;
  }
  if (v > 0x7FFFFFFFu) {
    return 0; // detools stores header sizes in signed int
  }
  *out = v;
  return 1;
}

// ---- `.mota` parse (fixed fields only) + EndF base location --------------------------------------
struct mota_min {
  uint32_t total, image_size, payload_size, payload_addr, approval_addr;
  uint32_t target_id, fw_version, block_count;
  uint8_t  base_hash[8], image_hash[32], hw_id[32];
  uint8_t  codec_id, is_full, approved, format_ver, flags, hash_algo, block_size_log2;
};
static int dt_geometry_ok(const struct mota_min *m, uint32_t body_len, uint32_t ws_span) {
  uint8_t  fixed;
  uint32_t p = 1, memory, segment, shift, from, to;
  if (m->payload_size < 2) {
    return 0;
  }
  if (!staged_read(m->payload_addr, &fixed, 1)) {
    return 0;
  }
  if (((fixed >> 4) & 0x07u) != 1u) {
    return 0; // detools PATCH_TYPE_IN_PLACE
  }
  if (!dt_header_u32(m->payload_addr, m->payload_size, &p, &memory) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &segment) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &shift) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &from) ||
      !dt_header_u32(m->payload_addr, m->payload_size, &p, &to)) {
    return 0;
  }
  if (memory == 0 || memory > ws_span || segment != PAGE || shift > memory || shift % segment != 0 ||
      from > memory - shift || to > memory) {
    return 0;
  }
  if (body_len > UINT32_MAX - ENDF_LEN || from != body_len + ENDF_LEN) {
    return 0;
  }
  return to == m->image_size && to <= ws_span;
}
static int parse_mota_at(uint32_t addr, uint32_t limit, struct mota_min *o) {
  uint8_t b[8 + MOTA_MFL]; // MAGIC+total + the whole fixed manifest-minus-leaves
  if (addr > limit) {
    return 0;
  }
  uint32_t avail = limit - addr;
  uint32_t hdr   = avail < sizeof(b) ? avail : sizeof(b);
  if (hdr < 8 + MOTA_MFL) {
    return 0; // need the whole fixed manifest in `b` (trailer read separately)
  }
  if (!staged_read(addr, b, hdr)) {
    return 0;
  }
  if (memcmp(b, MAGIC, 4) != 0) {
    return 0;
  }
  uint32_t total = rd_u32(b + 4);
  if (total < 8 + MOTA_MFL + 5 || total > avail) {
    return 0;
  }
  uint8_t tr[5];
  if (!staged_read(addr + total - 5, tr, 5)) {
    return 0;
  }
  if (memcmp(tr, TRAILER, 5) != 0) {
    return 0;
  }

  // Fixed-layout manifest - every field at a constant offset; base_hash/signer/signature are always
  // present (zero-filled when not applicable), so there are no conditionals (docs/ota_protocol.md Section 4).
  br_t r = {b, hdr, 0, 1};
  br_skip(&r, 4 + 4); // MAGIC + MOTA_TOTAL_SIZE (already validated above)
  o->format_ver = br_u8(&r);
  if (o->format_ver != 2
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
      && o->format_ver != 3
#endif
  ) {
    return 0;
  }
  o->flags     = br_u8(&r);
  o->hash_algo = br_u8(&r);
  o->target_id = br_u32(&r);
  o->fw_version = br_u32(&r);
  o->image_size   = br_u32(&r);
  o->payload_size = br_u32(&r);
  o->block_size_log2 = br_u8(&r);
  br_skip(&r, 4); // merkle_root (already verified by the approving app)
  const uint8_t *ih = br_take(&r, 32);
  if (ih) {
    memcpy(o->image_hash, ih, 32);
  }
  o->codec_id = br_u8(&r);
  const uint8_t *hw = br_take(&r, 32);
  if (hw) {
    memcpy(o->hw_id, hw, 32);
  }
  o->is_full        = (o->flags & MFLAG_FULL) ? 1 : 0;
  const uint8_t *bh = br_take(&r, 8);
  if (bh) {
    memcpy(o->base_hash, bh, 8); // base_hash (zero for full)
  }
  br_skip(&r, 32 + 64);          // signer pubkey + signature (zero when unsigned)
  if (!r.ok) {
    return 0;
  }
  o->approval_addr  = addr + r.n;
  const uint8_t *ap = br_take(&r, 4);
  o->approved       = (ap && memcmp(ap, APRV, 4) == 0) ? 1 : 0;
  if (o->block_size_log2 == 0 || o->block_size_log2 > 24 || o->payload_size == 0) {
    return 0;
  }
  // Do all variable-length geometry in 64 bits. With corrupt 32-bit sizes, the old ceil-divide,
  // leaf-count multiplication, and final sum could wrap together into a small self-consistent `total`,
  // leaving payload_addr far outside the staged container.
  uint64_t bs  = 1ull << o->block_size_log2;
  uint64_t bc  = ((uint64_t)o->payload_size + bs - 1) / bs;
  uint64_t off = (uint64_t)r.n + bc * 4u; // leaves[] then payload
  if (bc == 0 || bc > 0xFFFFu || off + o->payload_size + 5u != total) {
    return 0;                             // payload must end exactly at the trailer
  }
  o->block_count = (uint32_t)bc;
  o->payload_addr = addr + (uint32_t)off; // exact-total check proves off < total <= avail
  o->total        = total;
  return 1;
}

// Scan page boundaries for a valid `.mota`, returning the HIGHEST one below the selected ceiling.
//
// Direction matters for safety. The app stages the container bottom-aligned and writes [write_start,
// stage_ceiling) contiguously (0xFF-padding the tail), so the *current* `.mota` is always the
// highest in flash; a leftover from a prior, differently-sized fetch sits strictly BELOW it (a larger
// new fetch overwrites everything from its lower start up to the ceiling). Scanning top-down therefore
// returns the current container and never stops on a stale one - and the caller's APRV check is applied
// to THAT (highest) container only, so a stale lower `.mota` is never applied even if it is still
// approved. Exact bottom-alignment also prevents a mismatched ceiling hint from selecting a package.
// (EndF is the mirror image: the app image grows up from APP_BASE, so the current trailer is
// the LOWEST valid marker and find_body_len scans bottom-up. Each marker is scanned from the end where
// the current one is encountered first.)
#define MOTA_MIN_LEN (8 + MOTA_MFL + 5)
static uint32_t scan_mota(struct mota_min *o, uint32_t stage_ceiling) {
#if defined(MOTA_SD_CARD)
  (void)stage_ceiling;
  uint8_t handoff[MOTA_SD_SECTOR_SIZE];
  if (!ota_sd_init() || !ota_sd_read_sector(MOTA_SD_HANDOFF_SECTOR, handoff)) {
    return 0;
  }
  if (memcmp(handoff, MOTA_SD_HANDOFF_MAGIC, 8) != 0 || mota_sd_handoff_rd32(handoff + 8) != MOTA_SD_HANDOFF_VERSION ||
      mota_sd_handoff_crc32(handoff, 32) != mota_sd_handoff_rd32(handoff + 32)) {
    return 0;
  }
  uint32_t first        = mota_sd_handoff_rd32(handoff + 12);
  uint32_t sectors      = mota_sd_handoff_rd32(handoff + 16);
  uint32_t total        = mota_sd_handoff_rd32(handoff + 20);
  uint32_t total_inv    = mota_sd_handoff_rd32(handoff + 24);
  uint32_t card_sectors = mota_sd_handoff_rd32(handoff + 28);
  if (first <= MOTA_SD_HANDOFF_SECTOR || sectors == 0 || total < MOTA_MIN_LEN || total_inv != ~total ||
      (uint64_t)sectors * MOTA_SD_SECTOR_SIZE < total || first >= card_sectors || sectors > card_sectors - first) {
    return 0;
  }
  g_sd_first_sector = first;
  g_sd_total_size   = total;
  if (!parse_mota_at(0, g_sd_total_size, o) || o->total != total) {
    return 0;
  }
  return 1; // nonzero sentinel; container begins at file offset 0
#else
  #if defined(MOTA_QSPI_FLASH)
  if (g_qspi_source) {
    if (!ota_qspi_init()) {
      return 0;
    }
    uint32_t capacity = ota_qspi_capacity();
    if (capacity < MOTA_MIN_LEN) {
      return 0;
    }
    g_qspi_total_size = capacity; // permits the initial bounded header/manifest reads
    if (!parse_mota_at(0, capacity, o)) {
      return 0;
    }
    g_qspi_total_size = o->total;
    return 1; // external container begins at offset zero
  }
  #endif
  if (stage_ceiling != MOTA_NRF52_STAGE_CEILING_LEGACY && stage_ceiling != MOTA_NRF52_STAGE_CEILING_EXPANDED
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
      && stage_ceiling != MOTA_NRF52_BL_SCRATCH_START
#endif
  ) {
    return 0;
  }
  uint32_t top = (stage_ceiling - MOTA_MIN_LEN) & ~(PAGE - 1);
  for (uint32_t a = top + PAGE; a > APP_BASE;) { // walk page boundaries high -> low
    a -= PAGE;
    inherited_watchdog_feed();
    uint8_t m4[4];
    fl_read(a, m4, 4);
    if (memcmp(m4, MAGIC, 4) == 0 && parse_mota_at(a, stage_ceiling, o) &&
        ((stage_ceiling - o->total) & ~(PAGE - 1u)) == a) {
      return a;
    }
  }
  return 0;
#endif
}

// Locate the running image's EndF trailer (= body_len) by scanning bottom-up for the self-validating
// marker (mirrors the app's FirmwareInfo::find_self_firmware). We deliberately do NOT trust
// bootloader_settings.bank_0_size: the UF2 flasher does not set it to the exact EndF-inclusive image
// size, so trusting it makes a freshly UF2-flashed app fail the base check and silently refuse its first
// OTA update. Bottom-up returns the CURRENT (lowest) trailer; a stale one from a prior larger image sits
// above it and is never reached. No hash check is needed here: the caller immediately recomputes
// sha256(body) and compares it to the delta's base_hash, so a (vanishingly unlikely) coincidental "EndF"
// just fails that gate and the update is refused - never misapplied. Byte-by-byte (like the app) so no
// body_len alignment is assumed; the scan stops at the first match (the current image's trailer).
static int find_body_len(uint32_t app_limit, uint32_t *body_len_out) {
  if (app_limit <= APP_BASE) {
    return 0;
  }
  for (uint32_t off = 0; off + ENDF_LEN <= app_limit - APP_BASE; off++) {
    if ((off & (PAGE - 1u)) == 0) {
      inherited_watchdog_feed();
    }
    uint8_t e[8];
    fl_read(APP_BASE + off, e, 8); // marker(4) + body_len(4)
    if (memcmp(e, ENDF, 4) == 0 && rd_u32(e + 4) == off) {
      *body_len_out = off;
      return 1;
    }
  }
  return 0;
}

