mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
static int clear_approval(const struct mota_min *o) {
#if defined(MOTA_SD_CARD)
  // The trigger was already consumed from GPREGRET. The app invalidates sector
  // 1 before staging another update, so the SD file cannot be retried by a
  // normal reset and no raw-sector write implementation is needed here.
  (void)o;
  return 1;
#elif defined(MOTA_QSPI_FLASH)
  if (g_qspi_source) {
    uint8_t z[4] = {0, 0, 0, 0};
    return ota_qspi_write(o->approval_addr, z, sizeof(z)) ? 1 : 0;
  }
  uint8_t z[4] = {0, 0, 0, 0};
  cwrite(o->approval_addr, z, 4);
  cache_flush();
  return 1;
#else
  uint8_t z[4] = {0, 0, 0, 0};
  cwrite(o->approval_addr, z, 4);
  cache_flush();
  return 1;
#endif
}

#if defined(MOTA_SD_CARD) || defined(MOTA_QSPI_FLASH)
static bool finish_apply(bool result);

static int sha256_staged_region(uint32_t offset, uint32_t len, uint8_t out[32]) {
  sha256_ctx_t c;
  sha256_init(&c);
  uint8_t buf[256];
  while (len) {
    inherited_watchdog_feed();
    uint32_t n = len < sizeof(buf) ? len : sizeof(buf);
    if (!staged_read(offset, buf, n)) {
      return 0;
    }
    sha256_update(&c, buf, n);
    offset += n;
    len -= n;
  }
  sha256_final(&c, out);
  return 1;
}

#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
#if USB_DESC_UF2_PID == 0x0044
static const uint8_t BOOT_UPDATE_HW_ID[32] = "XIAO_BL_28860044";
#else
static const uint8_t BOOT_UPDATE_HW_ID[32] = "XIAO_BL_28860045";
#endif

#ifndef OTA_DELTA_HOST_TEST
typedef char boot_update_start_must_match_dfu
  [(BOOTLOADER_ADDR_START == MOTA_NRF52_BL_START) ? 1 : -1];
typedef char boot_update_size_must_match_dfu
  [(DFU_BL_IMAGE_MAX_SIZE == MOTA_NRF52_BL_SIZE) ? 1 : -1];
typedef char boot_update_scratch_must_match_dfu
  [(BOOTLOADER_ADDR_NEW_RECEIVED == MOTA_NRF52_BL_SCRATCH_START) ? 1 : -1];
#endif

static int boot_vectors_valid(const uint8_t vectors[8]) {
  const uint32_t initial_sp = rd_u32(vectors);
  const uint32_t reset      = rd_u32(vectors + 4);
  const uint32_t reset_addr = reset & ~1u;
  return (initial_sp & 7u) == 0 && initial_sp >= 0x20000000u && initial_sp <= 0x20040000u &&
         (reset & 1u) != 0 && reset_addr >= MOTA_NRF52_BL_START &&
         reset_addr < MOTA_NRF52_BL_START + MOTA_NRF52_BL_SIZE;
}

static int staged_vectors_valid(uint32_t payload_addr) {
  uint8_t vectors[8];
  return staged_read(payload_addr, vectors, sizeof(vectors)) && boot_vectors_valid(vectors);
}

static int boot_payload_integrity_valid(const struct mota_min *m) {
  uint8_t image_hash[32];
  // The running application verified the signed manifest, all leaves, and the
  // Merkle root before writing APRV. Recompute the full 256-bit image anchor
  // here; this covers every payload byte without duplicating the Merkle engine
  // in the size-constrained bootloader.
  return sha256_staged_region(m->payload_addr, m->payload_size, image_hash) &&
         memcmp(image_hash, m->image_hash, sizeof(image_hash)) == 0;
}

static int boot_update_policy_valid(const struct mota_min *m) {
  static const uint8_t zeros[8];
  return m->format_ver == 3 && m->flags == (MFLAG_FULL | MFLAG_SIGNED | MFLAG_BOOTLOADER) &&
         m->hash_algo == 0x12u && m->is_full && m->codec_id == CODEC_FULL &&
         m->target_id == BOOT_UPDATE_BOARD_ID && m->fw_version != 0 &&
         memcmp(m->hw_id, BOOT_UPDATE_HW_ID, sizeof(m->hw_id)) == 0 &&
         memcmp(m->base_hash, zeros, sizeof(zeros)) == 0 && m->block_size_log2 == 10u && m->block_count == 40u &&
         m->image_size == MOTA_NRF52_BL_SIZE && m->payload_size == MOTA_NRF52_BL_SIZE;
}

#ifdef OTA_DELTA_HOST_TEST
extern const uint8_t *otah_flash_pointer(uint32_t address, uint32_t len);
extern int            otah_mbr_copy_bl(uint32_t source, uint32_t word_count);
#endif

static const uint8_t *boot_scratch_pointer(void) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_flash_pointer(MOTA_NRF52_BL_SCRATCH_START, MOTA_NRF52_BL_SIZE);
#else
  return (const uint8_t *)(uintptr_t)MOTA_NRF52_BL_SCRATCH_START;
#endif
}

static int boot_scratch_caps_valid(const uint8_t *image) {
  static const uint8_t magic[8] = {MOTA_BL_MAGIC0, MOTA_BL_MAGIC1, MOTA_BL_MAGIC2, MOTA_BL_MAGIC3,
                                   MOTA_BL_MAGIC4, MOTA_BL_MAGIC5, MOTA_BL_MAGIC6, MOTA_BL_MAGIC7};
  // Scan every aligned match: a magic copy in a literal pool must not hide the
  // real capability marker later in the image.
  for (uint32_t off = 0; off + sizeof(mota_bl_info_t) <= MOTA_NRF52_BL_SIZE; off += 4u) {
    const mota_bl_info_t *caps = (const void *)(image + off);
    if (memcmp(caps->magic, magic, sizeof(magic)) == 0 && caps->apply_abi >= 3u &&
        caps->apply_abi != UINT16_MAX &&
        (caps->codec_mask & (1u << CODEC_FULL)) != 0 &&
        (caps->storage_flags[0] & (MOTA_BL_STORAGE_QSPI | MOTA_BL_STORAGE_BOOT_UPDATE)) ==
          (MOTA_BL_STORAGE_QSPI | MOTA_BL_STORAGE_BOOT_UPDATE) &&
        (caps->storage_flags[0] & 0xF0u) == 0 &&
        (caps->storage_flags[1] | caps->storage_flags[2] | caps->storage_flags[3]) == 0) {
      return 1;
    }
  }
  return 0;
}

static int copy_bootloader_to_scratch(const struct mota_min *m) {
  uint8_t readback[256];
  for (uint32_t off = 0; off < MOTA_NRF52_BL_SIZE; off += PAGE) {
    inherited_watchdog_feed();
    if (!staged_read(m->payload_addr + off, g_cache, PAGE)) {
      return 0;
    }
    fl_erase(MOTA_NRF52_BL_SCRATCH_START + off);
    inherited_watchdog_feed();
    fl_write_words(MOTA_NRF52_BL_SCRATCH_START + off, (const uint32_t *)g_cache, PAGE / 4u);
    for (uint32_t page_off = 0; page_off < PAGE; page_off += sizeof(readback)) {
      inherited_watchdog_feed();
      fl_read(MOTA_NRF52_BL_SCRATCH_START + off + page_off, readback, sizeof(readback));
      if (memcmp(readback, g_cache + page_off, sizeof(readback)) != 0) {
        return 0;
      }
    }
  }

  uint8_t hash[32];
  sha256_region(MOTA_NRF52_BL_SCRATCH_START, MOTA_NRF52_BL_SIZE, hash);
  return memcmp(hash, m->image_hash, sizeof(hash)) == 0;
}

static int boot_scratch_metadata_valid(void) {
  const uint8_t *scratch = boot_scratch_pointer();
  return scratch && bootloader_image_validate(scratch, MOTA_NRF52_BL_START, MOTA_NRF52_BL_SIZE,
                                              BOOT_UPDATE_BOARD_ID, DEVICE_NAME) &&
         boot_scratch_caps_valid(scratch);
}

static int mbr_copy_bootloader(void) {
#ifdef OTA_DELTA_HOST_TEST
  return otah_mbr_copy_bl(MOTA_NRF52_BL_SCRATCH_START, MOTA_NRF52_BL_SIZE / 4u);
#else
  sd_mbr_command_t command = {
    .command = SD_MBR_COMMAND_COPY_BL,
    .params.copy_bl.bl_src = (uint32_t *)MOTA_NRF52_BL_SCRATCH_START,
    .params.copy_bl.bl_len = MOTA_NRF52_BL_SIZE / 4u,
  };
  (void)sd_mbr_command(&command); // success does not return
  return 0;
#endif
}

static bool boot_update_reject(const struct mota_min *m, uint32_t result) {
  gpregret2_set(result);
  if (m && m->approved && !clear_approval(m)) {
    gpregret2_set(GPREGRET2_BL_APPROVAL);
  }
  return finish_apply(false);
}

