mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
static bool apply_bootloader_external(void) {
  const uint32_t source = gpregret2_get();
  gpregret_set(0); // consume first: every validation/copy failure is fail-closed
  gpregret2_set(GPREGRET2_BL_GATE);
  if (source != GPREGRET2_OTA_STAGE_QSPI) {
    gpregret2_set(GPREGRET2_BL_CONTAINER);
    return finish_apply(false);
  }
  g_qspi_source = 1;
  struct mota_min m;
  if (!scan_mota(&m, APP_APPLY_END) || !m.approved) {
    gpregret2_set(GPREGRET2_BL_CONTAINER);
    return finish_apply(false);
  }
  if (!boot_update_policy_valid(&m)) {
    return boot_update_reject(&m, GPREGRET2_BL_POLICY);
  }
  if (!staged_vectors_valid(m.payload_addr) || !boot_payload_integrity_valid(&m)) {
    return boot_update_reject(&m, GPREGRET2_BL_INTEGRITY);
  }
  if (!clear_approval(&m)) {
    gpregret2_set(GPREGRET2_BL_APPROVAL);
    return finish_apply(false);
  }
  if (!copy_bootloader_to_scratch(&m)) {
    gpregret2_set(GPREGRET2_BL_COPY);
    return finish_apply(false);
  }
  // Scratch is outside the application and old bootloader. Validate the exact
  // embedded board manifest/CRC and continuity capability before the MBR sees
  // it; a reset before this point simply boots the unchanged old image.
  if (!boot_scratch_metadata_valid()) {
    gpregret2_set(GPREGRET2_BL_MANIFEST);
    return finish_apply(false);
  }

  // The external flash is no longer needed. Finish its pending operations and
  // enter deep power-down before asking the MBR to replace this bootloader.
  ota_qspi_deinit();
  g_qspi_source = 0;
  gpregret2_set(GPREGRET2_BL_MBR_HANDOFF);
  if (mbr_copy_bootloader()) {
    return true; // host-only success model; hardware success never returns
  }
  gpregret2_set(GPREGRET2_BL_MBR_RETURNED);
  return false;
}
#endif // MOTA_QSPI_BOOTLOADER_UPDATE

static bool apply_full_external(const struct mota_min *m) {
  if (!m->is_full || m->codec_id != CODEC_FULL || m->image_size == 0 || m->payload_size != m->image_size ||
      m->image_size > APP_APPLY_END - APP_BASE) {
    gpregret2_set(0xB3);
    return false;
  }

  // Verify the complete external payload before the first destructive flash write.
  uint8_t h[32];
  if (!sha256_staged_region(m->payload_addr, m->payload_size, h) || memcmp(h, m->image_hash, sizeof(h)) != 0) {
    gpregret2_set(0xBA);
    return false;
  }

  if (!clear_approval(m)) {
    gpregret2_set(0xBC);
    return false;
  }
  inherited_watchdog_feed();
  otah_settings_commit(BANK_INVALID_APP_V, 0, 0);
  g_cache_page  = 0;
  g_cache_dirty = 0;

  for (uint32_t off = 0; off < m->image_size; off += PAGE) {
    inherited_watchdog_feed();
    uint32_t n = m->image_size - off;
    if (n > PAGE) {
      n = PAGE;
    }
    memset(g_cache, 0xFF, PAGE);
    if (!staged_read(m->payload_addr + off, g_cache, n)) {
      gpregret2_set(0xBB);
      return false;
    }
    fl_erase(APP_BASE + off);
    inherited_watchdog_feed();
    fl_write_words(APP_BASE + off, (const uint32_t *)g_cache, PAGE / 4);
  }

  sha256_region(APP_BASE, m->image_size, h);
  if (memcmp(h, m->image_hash, sizeof(h)) != 0) {
    gpregret2_set(0xB7);
    return false;
  }
  inherited_watchdog_feed();
  uint16_t image_crc = crc16_region(APP_BASE, m->image_size);
  inherited_watchdog_feed();
  otah_settings_commit(BANK_VALID_APP_V, image_crc, m->image_size);
  gpregret2_set(0xB8);
  return true;
}
#endif

static bool finish_apply(bool result) {
#if defined(MOTA_SD_CARD)
  // A rejected handoff falls through to the application without a hardware
  // reset, so do not leave SPIM2 or the SD pins owned by the bootloader.
  ota_sd_deinit();
#elif defined(MOTA_QSPI_FLASH)
  if (g_qspi_source) {
    ota_qspi_deinit();
  }
#endif
  return result;
}

bool ota_delta_check_and_apply(void) {
  inherited_watchdog_feed();
  // Force a volatile read of the capability marker so -flto / --gc-sections cannot fold the reference away
  // and drop it - the running app scans the bootloader flash for it (ota_bl_info.h / OtaBlInfo.h).
  volatile uint8_t keep = *(const volatile uint8_t *)&g_mota_bl_info.magic[0];
  if (keep == 0) {
    return finish_apply(false); // 'M' (0x4D) != 0, so never taken; keeps the marker live
  }

  // A completed apply result is retained in GPREGRET2 for the application to
  // report after the reset. Do not replace it during the normal post-apply
  // boot; only an explicit apply trigger starts a new diagnostic lifecycle.
  const uint32_t trigger = gpregret_get();
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  if (trigger == GPREGRET_BOOTLOADER_APPLY) {
    return apply_bootloader_external();
  }
#endif
  if (trigger != GPREGRET_OTA_APPLY) {
    return finish_apply(false);
  }

  // Read the app's staging-window handoff BEFORE GPREGRET2 becomes our diagnostic result register.
  // Backward compatibility is deliberately one-way safe: an old app leaves no recognized expanded
  // marker, so this bootloader scans only below ExtraFS. A new app uses EXPANDED only after finding the
  // matching capability bit in g_mota_bl_info.
  const uint32_t stage_handoff = gpregret2_get();
#if defined(MOTA_QSPI_FLASH)
  g_qspi_source = stage_handoff == GPREGRET2_OTA_STAGE_QSPI;
#endif
  uint32_t stage_ceiling =
    stage_handoff == GPREGRET2_OTA_STAGE_EXPANDED ? MOTA_NRF52_STAGE_CEILING_EXPANDED : MOTA_NRF52_STAGE_CEILING_LEGACY;
#if defined(MOTA_QSPI_BOOTLOADER_UPDATE)
  if (stage_ceiling > APP_APPLY_END) {
    stage_ceiling = APP_APPLY_END;
  }
#endif
#if defined(MOTA_SD_CARD)
  const uint32_t app_limit = APP_APPLY_END;
#elif defined(MOTA_QSPI_FLASH)
  const uint32_t app_limit = g_qspi_source ? APP_APPLY_END : stage_ceiling;
#else
  const uint32_t app_limit = stage_ceiling;
#endif
  // ---- DIAGNOSTIC: stash a bail/progress code in GPREGRET2; the app reads it back into `ota status`.
  // 0xB1 gate passed (GPREGRET was 0x6A) | 0xB2 no/unapproved mota |
  // 0xB3 bad full/codec | 0xB4 no body_len | 0xB5 base mismatch | 0xB9 bad detools geometry |
  // 0xBA external full pre-hash mismatch | 0xBB external read failure | 0xBC approval clear failure |
  // 0x9N detools err N | 0xB6 wrong size | 0xB7 result-hash mismatch | 0xB8 SUCCESS.
  gpregret_set(0); // consume the trigger so we never loop
  gpregret2_set(0xB1);

