mikecarper/Adafruit_nRF52_Bootloader_OTAFIX/src/ota_delta.c
  struct mota_min m;
  uint32_t        mota_addr = scan_mota(&m, stage_ceiling);
  if (!mota_addr || !m.approved) {
    gpregret2_set(0xB2);
    return finish_apply(false);
  } // nothing staged / unapproved

  // Format v3 is reserved for the distinct bootloader-update trigger. This is
  // the compatibility firewall that prevents a 40 KiB raw bootloader payload
  // from ever being installed at APP_BASE by the ordinary 0x6A path.
  if (m.format_ver != 2 || (m.flags & ~(MFLAG_FULL | MFLAG_SIGNED)) != 0) {
    gpregret2_set(0xB3);
    goto reject;
  }

#if defined(MOTA_SD_CARD)
  if (m.is_full) {
    return finish_apply(apply_full_external(&m));
  }
#elif defined(MOTA_QSPI_FLASH)
  if (g_qspi_source && m.is_full) {
    return finish_apply(apply_full_external(&m));
  }
#endif

  // base check (non-destructive): the running image's body must hash to the delta's base_hash.
  // Any pre-apply rejection clears the approval (this `.mota` is not applicable) and boots normally.
  uint32_t body_len;
  uint8_t  base32[32];
  if (m.is_full || m.codec_id != CODEC_INPLACE || m.image_size == 0 || m.image_size > app_limit - APP_BASE) {
    gpregret2_set(0xB3);
    goto reject;
  }
  if (!find_body_len(app_limit, &body_len)) {
    gpregret2_set(0xB4);
    goto reject;
  }
  sha256_region(APP_BASE, body_len, base32);
  if (memcmp(base32, m.base_hash, 8) != 0) {
    gpregret2_set(0xB5);
    goto reject;
  } // wrong base
#if defined(MOTA_SD_CARD)
  const uint32_t workspace_span = app_limit - APP_BASE;
#elif defined(MOTA_QSPI_FLASH)
  const uint32_t workspace_span = g_qspi_source ? app_limit - APP_BASE : mota_addr - APP_BASE;
#else
  const uint32_t workspace_span = mota_addr - APP_BASE;
#endif
  if (!dt_geometry_ok(&m, body_len, workspace_span)) {
    gpregret2_set(0xB9);
    goto reject;
  }

  // Consume approval before invalidating or modifying the application. A QSPI
  // program failure must leave the still-valid running image bootable.
  if (!clear_approval(&m)) {
    gpregret2_set(0xBC);
    return finish_apply(false);
  }

  // Commit point: make every subsequent reset enter DFU BEFORE the first destructive application write.
  // This is essential for UF2-installed apps, whose zero CRC otherwise makes a partial image bootable.
  inherited_watchdog_feed();
  otah_settings_commit(BANK_INVALID_APP_V, 0, 0);

  struct apply_ctx c;
  c.patch_addr = m.payload_addr;
  c.patch_len  = m.payload_size;
  c.patch_pos  = 0;
  c.ws_lo      = APP_BASE;
#if defined(MOTA_SD_CARD)
  c.ws_hi = app_limit; // patch is off-chip; whole app region is workspace
#elif defined(MOTA_QSPI_FLASH)
  c.ws_hi = g_qspi_source ? app_limit : mota_addr;
#else
  c.ws_hi = mota_addr; // workspace stays strictly below internal mota
#endif
  c.step = 0;
  int r  = detools_apply_patch_in_place_callbacks(dt_mr, dt_mw, dt_me, dt_ss, dt_sg, dt_pr, (size_t)m.payload_size, &c);
  cache_flush();
  if (r < 0) {
    gpregret2_set(0x90 | ((uint32_t)(-r) & 0x0F));
    return finish_apply(false);
  }
  if ((uint32_t)r != m.image_size) {
    gpregret2_set(0xB6);
    return finish_apply(false);
  }

  uint8_t h[32];
  sha256_region(APP_BASE, m.image_size, h);
  if (memcmp(h, m.image_hash, 32) != 0) {
    gpregret2_set(0xB7);
    return finish_apply(false);
  }

  inherited_watchdog_feed();
  uint16_t image_crc = crc16_region(APP_BASE, m.image_size);
  inherited_watchdog_feed();
  otah_settings_commit(BANK_VALID_APP_V, image_crc, m.image_size);
  gpregret2_set(0xB8);
  return finish_apply(true);

reject:
  if (!clear_approval(&m)) {
    gpregret2_set(0xBC);
  }
  return finish_apply(false);
}
